#### Terraform Plan 📖 ####
<details><summary>Show Plan</summary>

```terraform
tailscale_tailnet_key.main: Refreshing state... [id=kANHoGieHD11CNTRL]
data.cloudflare_ip_ranges.main: Reading...
data.cloudflare_account.main: Reading...
data.cloudflare_ip_ranges.main: Read complete after 0s
oci_core_network_security_group_security_rule.load-balancer-to-global: Refreshing state... [id=93E16C]
oci_core_network_security_group.load-balancer: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaalhg56iu7johmjdge35yrafgoquxnfuukeezma5sejbegdyghagaq]
oci_logging_log.load-balancer-access: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qawlujhtxaxz4drs7i4tojl4l5akflvqjsodbcghcz2nvq]
oci_core_network_security_group_security_rule.load-balancer-from-https: Refreshing state... [id=270C2F]
oci_load_balancer_backend_set.main: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga/backendSets/platform-backend-set]
oci_monitoring_alarm.load-balancer-health: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qa6bqigwre2ojntewig34hro6ggiddynjzbln4pkm6uoaa]
oci_monitoring_alarm.load-balancer-bandwidth: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qaezb57s4mvb346pdiwznadug6uc4canyzrmt6qyjqkptq]
oci_core_network_security_group_security_rule.worker-from-load-balancer: Refreshing state... [id=03EBBF]
oci_load_balancer_listener.http: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga/listeners/platform-listener-http]
data.cloudflare_account.main: Read complete after 0s [id=ec0cbb953bed382efecdedb2fadea7c4]
oci_logging_log.load-balancer-error: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qa4ivpk7sbgrflajkzqxalmnmk47atcb3pbsnpl56y3i5a]
oci_core_network_security_group_security_rule.load-balancer-from-http: Refreshing state... [id=840F75]
oci_load_balancer_load_balancer.main: Refreshing state... [id=ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga]
oci_identity_group.managers: Refreshing state... [id=ocid1.group.oc1..aaaaaaaac7alsg5sta36d66mr4yflfdakygdxxusvnv54km3nznudlyvbaba]
oci_objectstorage_bucket.state: Refreshing state... [id=n/cnm7patunz1z/b/platform-state]
oci_identity_user.manager: Refreshing state... [id=ocid1.user.oc1..aaaaaaaafxpfydig3om5bsydxijntrc64fbbjalgrjybqq6i2eihpjkxpzta]
oci_identity_compartment.main: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq]
data.oci_identity_availability_domains.main: Reading...
data.oci_core_services.all_services: Reading...
data.oci_containerengine_cluster_option.main: Reading...
oci_budget_budget.main: Refreshing state... [id=ocid1.budget.oc1.ap-seoul-1.amaaaaaabsyhd7qa2wpumdq7peealllchr7ao5lcpkldzdgzgq7qoij4x2yq]
cloudflare_zone.main: Refreshing state... [id=17ad56810b60da50d4fc69f477b6e3fd]
data.oci_core_services.all_services: Read complete after 0s [id=CoreServicesDataSource-0]
cloudflare_zone_setting.tls-version: Refreshing state... [id=min_tls_version]
cloudflare_zone_setting.security-level: Refreshing state... [id=security_level]
cloudflare_zone_setting.ssl-mode: Refreshing state... [id=ssl]
cloudflare_zone_setting.secure-mode: Refreshing state... [id=always_use_https]
oci_ons_notification_topic.main: Refreshing state... [id=ocid1.onstopic.oc1.ap-seoul-1.amaaaaaabsyhd7qaitbrw7kzaoyqmbd5ld4hrjt6wss4fexrwgz4qngcknga]
oci_identity_policy.cluster: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaagu6nbrnawfhjdwnrkfbzn6smo345m22gzfl55qxvxt7vep4yfqeq]
data.oci_core_images.ubuntu: Reading...
data.oci_identity_availability_domains.main: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-686890930]
oci_logging_log_group.main: Refreshing state... [id=ocid1.loggroup.oc1.ap-seoul-1.amaaaaaabsyhd7qaqvtgvi64v26joo3vxbfpml4csr72nwk5cirrxqpjotda]
oci_core_vcn.main: Refreshing state... [id=ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q]
oci_artifacts_container_repository.application: Refreshing state... [id=ocid1.containerrepo.oc1.ap-seoul-1.0.cnm7patunz1z.aaaaaaaa7rlpcolbbhe2tqr3r4tokxl4wizslzh4pryinxffib4wdq3mzhma]
oci_core_public_ip.main: Refreshing state... [id=ocid1.publicip.oc1.ap-seoul-1.amaaaaaabsyhd7qafbingjhb7nxqn3qcaowsc7sgyi2trscfa6jzlhu7wvmq]
data.oci_identity_fault_domains.main: Reading...
oci_identity_auth_token.application: Refreshing state... [id=ocid1.credential.oc1..aaaaaaaad6ed2wnvwb7pqj6mipgcodcurwrqz35u2elduhntp72r7yemi6ea]
oci_identity_user_group_membership.manager: Refreshing state... [id=ocid1.groupmembership.oc1..aaaaaaaa3mgwk4qef6qpqqgvi7duo7ep6ydxa6ionu4l5gx3vgffqaa3qutq]
oci_identity_policy.manager: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaayhc5xs4li2w3l32btbgwn5bh6om3lyn2y2qiyvcrsebvbno4e6cq]
data.oci_containerengine_cluster_option.main: Read complete after 1s [id=ContainerengineClusterOptionDataSource-1870923232]
oci_core_service_gateway.main: Refreshing state... [id=ocid1.servicegateway.oc1.ap-seoul-1.aaaaaaaa6pdgo7kccqt4r4cs747knrxybmaz2xkcvdaqau6ztjc2rdm3tnba]
oci_core_network_security_group.worker: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq]
data.oci_core_images.ubuntu: Read complete after 0s [id=CoreImagesDataSource-675692870]
oci_core_network_security_group.cluster: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaargvnkigajohw6qvznbzlrdtmivyeaunrlx5dgeqvugie7xywtnea]
data.oci_identity_fault_domains.main: Read complete after 0s [id=IdentityFaultDomainsDataSource-2954258040]
oci_core_internet_gateway.main: Refreshing state... [id=ocid1.internetgateway.oc1.ap-seoul-1.aaaaaaaaonpjrtiqcayeevrkbiavrrjberaljszeqx3xxucgnczyyn34u4ka]
oci_core_nat_gateway.main: Refreshing state... [id=ocid1.natgateway.oc1.ap-seoul-1.aaaaaaaap7fljb33jz7xfhnm54leup5owryl6xen4fzgkvnjqdz3dtsoupkq]
oci_core_network_security_group.bastion: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaayquhop5uavha3rpzt4lukx6kdpz6d6wraegzddtzahq4pnlwhzgq]
oci_budget_alert_rule.main: Refreshing state... [id=ocid1.alertrule.oc1.ap-seoul-1.amaaaaaabsyhd7qajb44qwouyva4scc7ygfqdopoxjihlhbakqyetfr2wv2q]
cloudflare_dns_record.monitor: Refreshing state... [id=8623234b3a1886a7ee026519eae943e6]
oci_monitoring_alarm.instance-memory: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qas5de7mmyekowv2zsbw2oxqz6pjwpqa5awsttqhtf4o2q]
oci_ons_subscription.email: Refreshing state... [id=ocid1.onssubscription.oc1.ap-seoul-1.aaaaaaaaaarkzfrko5jnvzkbpad3c5fojdswzzu3u47ffxiisu4agl4rqwzq]
oci_monitoring_alarm.instance-cpu: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qa6qx5fjp34nevhtdeneyqhjzt43stjxvzy6jip2gpcs6a]
oci_core_network_security_group_security_rule.worker-icmp: Refreshing state... [id=9C1E3C]
oci_core_network_security_group_security_rule.worker-from-worker: Refreshing state... [id=3CF182]
oci_core_network_security_group_security_rule.worker-to-global: Refreshing state... [id=903BB0]
oci_core_route_table.public: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaaf4htalzhwrxx4763yptthhd7oxu4schmuv2hq5u32xbi22pygdqq]
oci_core_network_security_group_security_rule.cluster-from-worker-management: Refreshing state... [id=407CCB]
oci_core_network_security_group_security_rule.cluster-from-worker-api: Refreshing state... [id=A3A3FB]
oci_core_network_security_group_security_rule.cluster-to-worker: Refreshing state... [id=8489A2]
oci_core_network_security_group_security_rule.worker-from-cluster: Refreshing state... [id=804EE8]
oci_core_network_security_group_security_rule.cluster-to-global: Refreshing state... [id=C704C9]
oci_core_network_security_group_security_rule.cluster-from-bastion: Refreshing state... [id=E359DE]
oci_core_network_security_group_security_rule.worker-from-bastion: Refreshing state... [id=DE31C8]
oci_core_network_security_group_security_rule.bastion-to-global: Refreshing state... [id=5B12E3]
oci_core_subnet.public: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq]
oci_core_route_table.private: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaa2gdnpvg6ecx744a63vowlzaagbsqkmbb7wuf2i5lyyilfaesfpmq]
oci_logging_log.subnet-public: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qahitcriuodikgvfgjk7qcjpapxg32de6zai6mtuuearca]
oci_core_subnet.private: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaz2zzw7w2kolrxzxelyfpu2lnsa6oths6txnblyewgc7wf3pr6dqq]
oci_logging_log.subnet-private: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qalejvdxip7gkcra4rcyqknkchnfumj4j766annytvv4ba]
tailscale_acl.main: Refreshing state... [id=1b5d5621-19fb-f490-b890-5cba657914cf]
oci_containerengine_cluster.main: Refreshing state... [id=ocid1.cluster.oc1.ap-seoul-1.aaaaaaaav675okbokp7hx5psdy6mt2bstn6zvvgvxvcuipmrvcxsuzj32fmq]
oci_core_instance.bastion: Refreshing state... [id=ocid1.instance.oc1.ap-seoul-1.anuwgljrbsyhd7qcrxmlulolu4tzvap7fgqnkmyhieqcmmbeo6eqktuawniq]
data.oci_containerengine_cluster_kube_config.main: Reading...
data.oci_containerengine_node_pool_option.main: Reading...
data.oci_containerengine_cluster_kube_config.main: Read complete after 0s [id=ContainerengineClusterKubeConfigDataSource-3656204518]
kubernetes_priority_class_v1.dev: Refreshing state... [id=priority-dev]
kubernetes_namespace_v1.main: Refreshing state... [id=main]
kubernetes_priority_class_v1.main: Refreshing state... [id=priority-main]
kubernetes_namespace_v1.system: Refreshing state... [id=system]
kubernetes_priority_class_v1.system: Refreshing state... [id=priority-system]
kubernetes_namespace_v1.dev: Refreshing state... [id=dev]
data.oci_containerengine_node_pool_option.main: Read complete after 1s [id=ContainerengineNodePoolOptionDataSource-3381421671]
oci_containerengine_node_pool.main: Refreshing state... [id=ocid1.nodepool.oc1.ap-seoul-1.aaaaaaaan674whrp5r7gjgbl3g3fvvpyfrnrg523vn3cs7vmtnz7pmrrmlia]
kubernetes_resource_quota_v1.main: Refreshing state... [id=main/quota-main]
kubernetes_limit_range_v1.main: Refreshing state... [id=main/limit-main]
kubernetes_limit_range_v1.system: Refreshing state... [id=system/limit-system]
kubernetes_resource_quota_v1.system: Refreshing state... [id=system/quota-system]
kubernetes_ingress_v1.monitor: Refreshing state... [id=system/ingress-monitor]
helm_release.controller: Refreshing state... [id=controller]
helm_release.monitor: Refreshing state... [id=monitor]
kubernetes_resource_quota_v1.dev: Refreshing state... [id=dev/quota-dev]
kubernetes_limit_range_v1.dev: Refreshing state... [id=dev/limit-dev]
kubernetes_deployment_v1.application-dev: Refreshing state... [id=dev/application-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # helm_release.controller will be updated in-place
  ~ resource "helm_release" "controller" {
      ~ id                         = "controller" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v3.6.5" -> (known after apply)
          ~ chart          = "traefik" -> (known after apply)
          ~ first_deployed = 1767481924 -> (known after apply)
          ~ last_deployed  = 1767481924 -> (known after apply)
          ~ name           = "controller" -> (known after apply)
          ~ namespace      = "system" -> (known after apply)
          ~ notes          = <<-EOT
                controller with docker.io/traefik:v3.6.5 has been deployed successfully on system namespace!
            EOT -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - additionalArguments = [
                      - "--entryPoints.websecure.forwardedHeaders.trustedIPs=173.245.48.0/20,103.21.244.0/22,103.22.200.0/22,103.31.4.0/22,141.101.64.0/18,108.162.192.0/18,190.93.240.0/20,188.114.96.0/20,197.234.240.0/22,198.41.128.0/17,162.158.0.0/15,104.16.0.0/13,104.24.0.0/14,172.64.0.0/13,131.0.72.0/22",
                      - "--entryPoints.websecure.proxyProtocol.trustedIPs=173.245.48.0/20,103.21.244.0/22,103.22.200.0/22,103.31.4.0/22,141.101.64.0/18,108.162.192.0/18,190.93.240.0/20,188.114.96.0/20,197.234.240.0/22,198.41.128.0/17,162.158.0.0/15,104.16.0.0/13,104.24.0.0/14,172.64.0.0/13,131.0.72.0/22",
                    ]
                  - deployment          = {
                      - podAntiAffinity = {
                          - preferredDuringSchedulingIgnoredDuringExecution = [
                              - {
                                  - podAffinityTerm = {
                                      - labelSelector = {
                                          - matchExpressions = [
                                              - {
                                                  - key      = "app.kubernetes.io/name"
                                                  - operator = "In"
                                                  - values   = [
                                                      - "traefik",
                                                    ]
                                                },
                                            ]
                                        }
                                      - topologyKey   = "kubernetes.io/hostname"
                                    }
                                  - weight          = 100
                                },
                            ]
                        }
                      - replicas        = 2
                    }
                  - globalArguments     = [
                      - "--global.checknewversion=false",
                      - "--global.sendanonymoususage=false",
                    ]
                  - ports               = {
                      - web       = {
                          - redirections = {
                              - entryPoint = {
                                  - scheme = "https"
                                  - to     = "websecure"
                                }
                            }
                        }
                      - websecure = {
                          - tls = {
                              - enabled = true
                            }
                        }
                    }
                  - priorityClassName   = "priority-system"
                  - resources           = {
                      - limits   = {
                          - cpu    = "200m"
                          - memory = "256Mi"
                        }
                      - requests = {
                          - cpu    = "100m"
                          - memory = "128Mi"
                        }
                    }
                  - service             = {
                      - annotations = {
                          - "service.beta.kubernetes.io/oci-load-balancer-id"             = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga"
                          - "service.beta.kubernetes.io/oci-load-balancer-internal"       = "false"
                          - "service.beta.kubernetes.io/oci-load-balancer-shape"          = "flexible"
                          - "service.beta.kubernetes.io/oci-load-balancer-shape-flex-max" = "10"
                          - "service.beta.kubernetes.io/oci-load-balancer-shape-flex-min" = "10"
                          - "service.beta.kubernetes.io/oci-load-balancer-subnet1"        = "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq"
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "38.0.1" -> (known after apply)
        } -> (known after apply)
        name                       = "controller"
      ~ values                     = [
          ~ jsonencode(
              ~ {
                  ~ service             = {
                      ~ annotations           = {
                          + "oci-network-load-balancer.oraclecloud.com/display-name"                = "platform-network-load-balancer"
                          + "oci-network-load-balancer.oraclecloud.com/oci-network-security-groups" = "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq"
                          + "oci-network-load-balancer.oraclecloud.com/subnet"                      = "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq"
                          - "service.beta.kubernetes.io/oci-load-balancer-id"                       = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga"
                          - "service.beta.kubernetes.io/oci-load-balancer-internal"                 = "false"
                          - "service.beta.kubernetes.io/oci-load-balancer-shape"                    = "flexible"
                          - "service.beta.kubernetes.io/oci-load-balancer-shape-flex-max"           = "10"
                          - "service.beta.kubernetes.io/oci-load-balancer-shape-flex-min"           = "10"
                          - "service.beta.kubernetes.io/oci-load-balancer-subnet1"                  = "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq"
                          + "service.beta.kubernetes.io/oci-network-load-balancer-type"             = "nlb"
                        }
                      + externalTrafficPolicy = "Local"
                      + loadBalancerIP        = "152.70.238.59"
                    }
                    # (6 unchanged attributes hidden)
                }
            ),
        ]
        # (29 unchanged attributes hidden)
    }

  # oci_core_network_security_group.load-balancer will be destroyed
  # (because oci_core_network_security_group.load-balancer is not in configuration)
  - resource "oci_core_network_security_group" "load-balancer" {
      - compartment_id = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> null
      - defined_tags   = {} -> null
      - display_name   = "platform-network-security-group-lb" -> null
      - freeform_tags  = {} -> null
      - id             = "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaalhg56iu7johmjdge35yrafgoquxnfuukeezma5sejbegdyghagaq" -> null
      - state          = "AVAILABLE" -> null
      - time_created   = "2026-01-03 09:44:35.079 +0000 UTC" -> null
      - vcn_id         = "ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q" -> null
    }

  # oci_core_network_security_group_security_rule.load-balancer-from-http will be destroyed
  # (because oci_core_network_security_group_security_rule.load-balancer-from-http is not in configuration)
  - resource "oci_core_network_security_group_security_rule" "load-balancer-from-http" {
      - direction                 = "INGRESS" -> null
      - id                        = "840F75" -> null
      - is_valid                  = true -> null
      - network_security_group_id = "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaalhg56iu7johmjdge35yrafgoquxnfuukeezma5sejbegdyghagaq" -> null
      - protocol                  = "6" -> null
      - source                    = "0.0.0.0/0" -> null
      - source_type               = "CIDR_BLOCK" -> null
      - stateless                 = false -> null
      - time_created              = "2026-01-03 09:44:35.63 +0000 UTC" -> null
        # (1 unchanged attribute hidden)

      - tcp_options {
          - destination_port_range {
              - max = 80 -> null
              - min = 80 -> null
            }
        }
    }

  # oci_core_network_security_group_security_rule.load-balancer-from-https will be destroyed
  # (because oci_core_network_security_group_security_rule.load-balancer-from-https is not in configuration)
  - resource "oci_core_network_security_group_security_rule" "load-balancer-from-https" {
      - direction                 = "INGRESS" -> null
      - id                        = "270C2F" -> null
      - is_valid                  = true -> null
      - network_security_group_id = "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaalhg56iu7johmjdge35yrafgoquxnfuukeezma5sejbegdyghagaq" -> null
      - protocol                  = "6" -> null
      - source                    = "0.0.0.0/0" -> null
      - source_type               = "CIDR_BLOCK" -> null
      - stateless                 = false -> null
      - time_created              = "2026-01-03 09:44:36.298 +0000 UTC" -> null
        # (1 unchanged attribute hidden)

      - tcp_options {
          - destination_port_range {
              - max = 443 -> null
              - min = 443 -> null
            }
        }
    }

  # oci_core_network_security_group_security_rule.load-balancer-to-global will be destroyed
  # (because oci_core_network_security_group_security_rule.load-balancer-to-global is not in configuration)
  - resource "oci_core_network_security_group_security_rule" "load-balancer-to-global" {
      - destination               = "0.0.0.0/0" -> null
      - destination_type          = "CIDR_BLOCK" -> null
      - direction                 = "EGRESS" -> null
      - id                        = "93E16C" -> null
      - is_valid                  = true -> null
      - network_security_group_id = "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaalhg56iu7johmjdge35yrafgoquxnfuukeezma5sejbegdyghagaq" -> null
      - protocol                  = "all" -> null
      - stateless                 = false -> null
      - time_created              = "2026-01-03 09:44:36.137 +0000 UTC" -> null
        # (1 unchanged attribute hidden)
    }

  # oci_core_network_security_group_security_rule.worker-from-http will be created
  + resource "oci_core_network_security_group_security_rule" "worker-from-http" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq"
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 80
              + min = 80
            }
        }
    }

  # oci_core_network_security_group_security_rule.worker-from-https will be created
  + resource "oci_core_network_security_group_security_rule" "worker-from-https" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq"
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 443
              + min = 443
            }
        }
    }

  # oci_core_network_security_group_security_rule.worker-from-load-balancer will be destroyed
  # (because oci_core_network_security_group_security_rule.worker-from-load-balancer is not in configuration)
  - resource "oci_core_network_security_group_security_rule" "worker-from-load-balancer" {
      - direction                 = "INGRESS" -> null
      - id                        = "03EBBF" -> null
      - is_valid                  = true -> null
      - network_security_group_id = "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq" -> null
      - protocol                  = "6" -> null
      - source                    = "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaalhg56iu7johmjdge35yrafgoquxnfuukeezma5sejbegdyghagaq" -> null
      - source_type               = "NETWORK_SECURITY_GROUP" -> null
      - stateless                 = false -> null
      - time_created              = "2026-01-03 09:44:35.979 +0000 UTC" -> null
        # (1 unchanged attribute hidden)

      - tcp_options {
          - destination_port_range {
              - max = 32767 -> null
              - min = 30000 -> null
            }
        }
    }

  # oci_load_balancer_backend_set.main will be destroyed
  # (because oci_load_balancer_backend_set.main is not in configuration)
  - resource "oci_load_balancer_backend_set" "main" {
      - backend          = [] -> null
      - id               = "loadBalancers/ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga/backendSets/platform-backend-set" -> null
      - load_balancer_id = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga" -> null
      - name             = "platform-backend-set" -> null
      - policy           = "ROUND_ROBIN" -> null
      - state            = "SUCCEEDED" -> null

      - health_checker {
          - interval_ms         = 30000 -> null
          - is_force_plain_text = false -> null
          - port                = 0 -> null
          - protocol            = "TCP" -> null
          - response_body_regex = ".*" -> null
          - retries             = 3 -> null
          - return_code         = 200 -> null
          - timeout_in_millis   = 3000 -> null
            # (1 unchanged attribute hidden)
        }
    }

  # oci_load_balancer_listener.http will be destroyed
  # (because oci_load_balancer_listener.http is not in configuration)
  - resource "oci_load_balancer_listener" "http" {
      - default_backend_set_name = "platform-backend-set" -> null
      - hostname_names           = [] -> null
      - id                       = "loadBalancers/ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga/listeners/platform-listener-http" -> null
      - load_balancer_id         = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga" -> null
      - name                     = "platform-listener-http" -> null
      - port                     = 80 -> null
      - protocol                 = "HTTP" -> null
      - rule_set_names           = [] -> null
      - state                    = "SUCCEEDED" -> null

      - connection_configuration {
          - backend_tcp_proxy_protocol_options = [] -> null
          - backend_tcp_proxy_protocol_version = 0 -> null
          - idle_timeout_in_seconds            = "60" -> null
        }
    }

  # oci_load_balancer_load_balancer.main will be destroyed
  # (because oci_load_balancer_load_balancer.main is not in configuration)
  - resource "oci_load_balancer_load_balancer" "main" {
      - compartment_id             = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> null
      - defined_tags               = {} -> null
      - display_name               = "platform-load-balancer" -> null
      - freeform_tags              = {} -> null
      - id                         = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga" -> null
      - ip_address_details         = [
          - {
              - ip_address  = "152.70.238.59"
              - is_public   = true
              - reserved_ip = [
                  - {
                      - id = "ocid1.publicip.oc1.ap-seoul-1.amaaaaaabsyhd7qafbingjhb7nxqn3qcaowsc7sgyi2trscfa6jzlhu7wvmq"
                    },
                ]
            },
        ] -> null
      - ip_addresses               = [
          - "152.70.238.59",
        ] -> null
      - ip_mode                    = "IPV4" -> null
      - is_private                 = false -> null
      - network_security_group_ids = [
          - "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaalhg56iu7johmjdge35yrafgoquxnfuukeezma5sejbegdyghagaq",
        ] -> null
      - security_attributes        = {} -> null
      - shape                      = "flexible" -> null
      - state                      = "ACTIVE" -> null
      - subnet_ids                 = [
          - "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq",
        ] -> null
      - system_tags                = {} -> null
      - time_created               = "2025-12-08 11:57:00.318 +0000 UTC" -> null

      - reserved_ips {
          - id = "ocid1.publicip.oc1.ap-seoul-1.amaaaaaabsyhd7qafbingjhb7nxqn3qcaowsc7sgyi2trscfa6jzlhu7wvmq" -> null
        }

      - shape_details {
          - maximum_bandwidth_in_mbps = 10 -> null
          - minimum_bandwidth_in_mbps = 10 -> null
        }
    }

  # oci_logging_log.load-balancer-access will be destroyed
  # (because oci_logging_log.load-balancer-access is not in configuration)
  - resource "oci_logging_log" "load-balancer-access" {
      - compartment_id     = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> null
      - defined_tags       = {} -> null
      - display_name       = "platform-log-load-balancer-access" -> null
      - freeform_tags      = {} -> null
      - id                 = "ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qawlujhtxaxz4drs7i4tojl4l5akflvqjsodbcghcz2nvq" -> null
      - is_enabled         = true -> null
      - log_group_id       = "ocid1.loggroup.oc1.ap-seoul-1.amaaaaaabsyhd7qaqvtgvi64v26joo3vxbfpml4csr72nwk5cirrxqpjotda" -> null
      - log_type           = "SERVICE" -> null
      - retention_duration = 30 -> null
      - state              = "ACTIVE" -> null
      - tenancy_id         = "ocid1.tenancy.oc1..aaaaaaaa5vwe52hngn55vyyitt2xeigrjqsibrlmewnsv2wjo3hnaw55i3aa" -> null
      - time_created       = "2025-12-28 05:32:00.217 +0000 UTC" -> null
      - time_last_modified = "2025-12-28 05:32:00.217 +0000 UTC" -> null

      - configuration {
          - compartment_id = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> null

          - source {
              - category    = "access" -> null
              - parameters  = {} -> null
              - resource    = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga" -> null
              - service     = "loadbalancer" -> null
              - source_type = "OCISERVICE" -> null
            }
        }
    }

  # oci_logging_log.load-balancer-error will be destroyed
  # (because oci_logging_log.load-balancer-error is not in configuration)
  - resource "oci_logging_log" "load-balancer-error" {
      - compartment_id     = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> null
      - defined_tags       = {} -> null
      - display_name       = "platform-log-load-balancer-error" -> null
      - freeform_tags      = {} -> null
      - id                 = "ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qa4ivpk7sbgrflajkzqxalmnmk47atcb3pbsnpl56y3i5a" -> null
      - is_enabled         = true -> null
      - log_group_id       = "ocid1.loggroup.oc1.ap-seoul-1.amaaaaaabsyhd7qaqvtgvi64v26joo3vxbfpml4csr72nwk5cirrxqpjotda" -> null
      - log_type           = "SERVICE" -> null
      - retention_duration = 30 -> null
      - state              = "ACTIVE" -> null
      - tenancy_id         = "ocid1.tenancy.oc1..aaaaaaaa5vwe52hngn55vyyitt2xeigrjqsibrlmewnsv2wjo3hnaw55i3aa" -> null
      - time_created       = "2025-12-28 05:32:00.229 +0000 UTC" -> null
      - time_last_modified = "2025-12-28 05:32:00.229 +0000 UTC" -> null

      - configuration {
          - compartment_id = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> null

          - source {
              - category    = "error" -> null
              - parameters  = {} -> null
              - resource    = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga" -> null
              - service     = "loadbalancer" -> null
              - source_type = "OCISERVICE" -> null
            }
        }
    }

  # oci_monitoring_alarm.load-balancer-bandwidth will be destroyed
  # (because oci_monitoring_alarm.load-balancer-bandwidth is not in configuration)
  - resource "oci_monitoring_alarm" "load-balancer-bandwidth" {
      - compartment_id                                = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> null
      - defined_tags                                  = {} -> null
      - destinations                                  = [
          - "ocid1.onstopic.oc1.ap-seoul-1.amaaaaaabsyhd7qaitbrw7kzaoyqmbd5ld4hrjt6wss4fexrwgz4qngcknga",
        ] -> null
      - display_name                                  = "platform-alarm-load-balancer-bandwidth" -> null
      - evaluation_slack_duration                     = "PT3M" -> null
      - freeform_tags                                 = {} -> null
      - id                                            = "ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qaezb57s4mvb346pdiwznadug6uc4canyzrmt6qyjqkptq" -> null
      - is_enabled                                    = true -> null
      - is_notifications_per_metric_dimension_enabled = false -> null
      - message_format                                = "RAW" -> null
      - metric_compartment_id                         = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> null
      - metric_compartment_id_in_subtree              = false -> null
      - namespace                                     = "oci_lbaas" -> null
      - notification_title                            = "platform-alarm-load-balancer-bandwidth" -> null
      - notification_version                          = "1.X" -> null
      - pending_duration                              = "PT1M" -> null
      - query                                         = "InboundBandwidthUsage[1m]{resourceId = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga"}.max() > 8" -> null
      - resolution                                    = "1m" -> null
      - rule_name                                     = "base" -> null
      - severity                                      = "WARNING" -> null
      - state                                         = "ACTIVE" -> null
      - time_created                                  = "2025-12-28 05:27:30.749 +0000 UTC" -> null
      - time_updated                                  = "2025-12-28 05:27:30.749 +0000 UTC" -> null
    }

  # oci_monitoring_alarm.load-balancer-health will be destroyed
  # (because oci_monitoring_alarm.load-balancer-health is not in configuration)
  - resource "oci_monitoring_alarm" "load-balancer-health" {
      - compartment_id                                = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> null
      - defined_tags                                  = {} -> null
      - destinations                                  = [
          - "ocid1.onstopic.oc1.ap-seoul-1.amaaaaaabsyhd7qaitbrw7kzaoyqmbd5ld4hrjt6wss4fexrwgz4qngcknga",
        ] -> null
      - display_name                                  = "platform-alarm-load-balancer-health" -> null
      - evaluation_slack_duration                     = "PT3M" -> null
      - freeform_tags                                 = {} -> null
      - id                                            = "ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qa6bqigwre2ojntewig34hro6ggiddynjzbln4pkm6uoaa" -> null
      - is_enabled                                    = true -> null
      - is_notifications_per_metric_dimension_enabled = false -> null
      - message_format                                = "RAW" -> null
      - metric_compartment_id                         = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> null
      - metric_compartment_id_in_subtree              = false -> null
      - namespace                                     = "oci_lbaas" -> null
      - notification_title                            = "platform-alarm-load-balancer-health" -> null
      - notification_version                          = "1.X" -> null
      - pending_duration                              = "PT1M" -> null
      - query                                         = "UnHealthyBackendServerCount[1m]{resourceId = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga"}.max() > 0" -> null
      - resolution                                    = "1m" -> null
      - rule_name                                     = "base" -> null
      - severity                                      = "CRITICAL" -> null
      - state                                         = "ACTIVE" -> null
      - time_created                                  = "2025-12-28 05:27:30.746 +0000 UTC" -> null
      - time_updated                                  = "2025-12-28 05:27:30.746 +0000 UTC" -> null
    }

Plan: 2 to add, 1 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @ensia96, Action: `pull_request`*